{"intents": [
  {
    "tag": "saludos",
    "patterns": ["hola", "hey", "buen dia", "alo", "buenas tardes", "buenas noches"],
    "responses": ["¿En qué le puedo ayudar? Recomiendo metodologías de estudio"]
  },
  {
    "tag": "preguntasGenerales",
    "patterns": ["que metodo usar?", "que hago con los estudiantes?", "como mejorar la clase?"],
    "responses": ["Dialogos cortos con los los estudiantes para saber como se sienten con respecto a la clase", "Utilizar dibujos de ser posible para hacer que los estudiantes comprendan mejor el tema", "Acercarse a los estudiantes para conocerlos y comprender la forma en la que piensan y los gustos que tienen"]
  },
  {
    "tag": "preguntasEstudio",
    "patterns": ["como mejorar la atencion de la clase?", "como hacer la clase mas entretenida?", "como tener mas atencion de mis estudiantes?"],
    "responses": ["Puede realizar pruebas diagnósticas sorpresas para tener a los estudiantes más enfocados en la clase", "Ofrecer alguna anécdota o contar algún chiste para ofrecer unos segundos de descanso y llamar nuevamente la atención de los estudiantes", "Utilizar los gustos/modas de los estudiantes para ofrecer analogías con relación al tema", "Mencionar curiosidades que puedan interesarles a los estudiantes que pueda tener relación con el tema"]
  },
  {
    "tag": "preguntasEstudiantesDificultosos",
    "patterns": ["como ayudo a un estudiante que tiene problemas?", "como nivelar a un estudiante?", "como mejorar el desempeño de un estudiante?"],
    "responses": ["Ofrecer una explicación adicional a aquellos que necesite un refuerzo adicional", "Conversar con el estudiante para saber donde son los puntos donde tiene problemas", "Ofrecer referencias ya sea en un libro o en internet donde pueda ayudarle con su problema"]
  },
  {
    "tag": "crearparciales",
    "patterns": ["que incluir en parciales?", "como hacer un examen?", "que deberia de poner en el ejercicio"],
    "responses": ["Las estrategias mas utilizadas para crear una prueba formativa son cierto y falso, llenar espacios, escoger la mejor respuesta, desarrollo, pareo, selección multiple"]
  },
  {
    "tag": "despedidas",
    "patterns": ["adios", "chao", "muchas gracias","vale","entendido"],
    "responses": ["¿Necesita algo más?", "¡Que tenga un buen día!", "Espero haber sido de ayuda", "¡Adiós!"]
  },
  {
    "tag": "alternativasNegativas",
    "patterns": ["no, eso ha sido todo", "no, gracias", "no"],
    "responses": ["¡Adiós!"]
  },
  {
    "tag": "alternativasPositivas",
    "patterns": ["si, necesito algo mas", "si, por favor", "si"],
    "responses": ["Estoy para servirle, ¿Cuál es su pregunta?", "Espero a su siguiente pregunta"]
  }
]
}